% %work1
% f=[3,0,-6,0,1];
% g=[0,0,1,0,-1];
% 
% h1=f+g;
% disp("f(x)+g(x)=");
% disp(h1);
% 
% h2=f-g;
% disp("f(x)-g(x)=");
% disp(h2);
% 
% %由于在进行除法的时候，分母必须不为0，
% %所以对g(x)的矩阵进行一个转化。
% g1=[1,0,-1];
% 
% h3=conv(f,g1);
% disp("f(x)*g(x)=");
% disp(h3);
% 
% %一开始以为，如果不按照格式[Q,r]进行填写的话会报错，
% %但是实际上，如果直接这么写的话也不会出现错误。
% h4=deconv(f,g1);
% %[h4,h5]=deconv(f,g1);
% disp("f(x)/g(x)=");
% disp(h4);
% 
% %商的导函数
% h=polyder(h4);
% disp('商的导函数=')
% disp(h);

% %work2
% x=1:2:19;
% %disp(x); 检验x的正确性
% y=[5.9,6.4,7.8,7.6,6.9,5.2,3.4,1.5,-0.7,-2];
% 
% %线性插值法
% %无语了，把1看成英文l
% c1=interp1(x,y,10);
% disp('线性插值法：');
% disp(c1);
% 
% %最近点插值法
% c2=interp1(x,y,10,'nearest');
% disp('最近点插值法：');
% disp(c2);
% 
% %3次埃尔米特插值法
% c3=interp1(x,y,10,'pchip');
% disp('3次埃尔米特插值法：');
% disp(c3);
% 
% %3次样条插值法
% c4=interp1(x,y,10,'spline');
% disp('3次样条插值法：');
% disp(c4);

%work3
%3次多项式拟合
x=[1,2,3,7,9,12,13,15,17];
y=[1.5,3.9,6.6,11.7,15.6,18.8,19.6,20.6,21.1];
p=polyfit(x,y,3);
p1=polyval(p,x);
subplot(1,2,1);
plot(x,y,':o',x,p1,'-*');
title('3次多项式拟合');

%5次多项式拟合
t=polyfit(x,y,5);
t1=polyval(t,x);
subplot(1,2,2);
plot(x,y,':o',x,t1,'-*');
title('5次多项式拟合');




